
// Каким будет результат этих выражений?

5 > 4 // true
"ананас" > "яблоко" // false
"2" > "12" // true
undefined == null // true
undefined === null // false
null == "\n0\n" // false
null === +"\n0\n" // false

Что вернет выражение true && false? //false
Что вернет выражение false || true? // true
Какое значение будет у переменной x после выполнения кода let x = 5; x += 10;? //15
Что вернет выражение typeof undefined? // undefined
Что вернет выражение typeof null? // object
Какое значение будет у переменной y после выполнения кода let y = parseInt("5")? // 5
Что вернет выражение Boolean("hello")? // true
Что вернет выражение Boolean(0)? // false
Что вернет выражение Boolean([])? // true
Что вернет выражение Boolean({})? //true
Какое значение будет у переменной z после выполнения кода let z = typeof NaN? // number
Что вернет выражение NaN === NaN? // false
Что вернет выражение 1 == "1"? // true
Что вернет выражение 1 === "1"? // false
Какое значение будет у переменной a после выполнения кода let a = 5 % 2? // 1
Что вернет выражение typeof 42? //number
Что вернет выражение typeof "Hello"? //string
Какое значение будет у переменной b после выполнения кода let b = !true? // fasle
Что вернет выражение !!0? // false
Что вернет выражение 10 > 5? // true
